In [1]:
import pandas as pd
# df=pd.read_csv('weather_csv')
student_data={
    'Name':['shaiksha','vivek','anil','kesava','sudhakar','abhisek'],
    'Maths':[78,57,85,98,56,73],
    'physcis':[67,98,93,45,87,99],
    'chemistry':[89,67,87,34,66,98],
    'biology':[99,56,73,34,67,23]       
}
df=pd.DataFrame(student_data)
df
# print(df)

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56
2      anil     85       93         87       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [2]:
rows,columns=df.shape
df.shape

(6, 5)

In [3]:
rows,columns

(6, 5)

In [4]:
df.head(2)

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56

In [5]:
df.tail(2)

       Name  Maths  physcis  chemistry  biology
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [6]:
df[2:5]#slicling 5 is not included

       Name  Maths  physcis  chemistry  biology
2      anil     85       93         87       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67

In [ ]:
df.columns
# o/p:-Index(['Name', 'Maths', 'physcis', 'chemistry', 'biology'], dtype='object')

In [7]:
# df.Name
df['Name']

0    shaiksha
1       vivek
2        anil
3      kesava
4    sudhakar
5     abhisek
Name: Name, dtype: object

In [8]:
type(df['Name'])
# o/p:-pandas.core.series.Series

pandas.core.series.Series

In [9]:
df[['Name','Maths']].head(2)

       Name  Maths
0  shaiksha     78
1     vivek     57

In [10]:
#max core in physcics
df['physcis'].max()
#average
df['physcis'].mean()

81.5

In [11]:
#print the satistic in dataframe
df.describe()

           Maths   physcis  chemistry    biology
count   6.000000   6.00000   6.000000   6.000000
mean   74.500000  81.50000  73.500000  58.666667
std    16.281892  21.37054  23.158152  27.529378
min    56.000000  45.00000  34.000000  23.000000
25%    61.000000  72.00000  66.250000  39.500000
50%    75.500000  90.00000  77.000000  61.500000
75%    83.250000  96.75000  88.500000  71.500000
max    98.000000  99.00000  98.000000  99.000000

In [14]:
df[df.Maths>35]

       Name  Maths  physcis  chemistry  biology
0  shaiksha     78       67         89       99
1     vivek     57       98         67       56
2      anil     85       93         87       73
3    kesava     98       45         34       34
4  sudhakar     56       87         66       67
5   abhisek     73       99         98       23

In [19]:
# get the highest score in chemistry
#df[df.chemistry==df.chemistry.max()]
#i want print specify column
df[['Name','physcis']]
df[df.chemistry==df.chemistry.max()]

      Name  Maths  physcis  chemistry  biology
5  abhisek     73       99         98       23

In [23]:
#set index column
df.set_index('biology',inplace=True)

KeyError: "None of ['biology'] are in the columns"

In [24]:
#fetch the data of the specific row
df.loc[73]

Name         anil
Maths          85
physcis        93
chemistry      87
Name: 73, dtype: object

In [25]:
#reset original function
df.reset_index(inplace=True)

In [26]:
df

   biology      Name  Maths  physcis  chemistry
0       99  shaiksha     78       67         89
1       56     vivek     57       98         67
2       73      anil     85       93         87
3       34    kesava     98       45         34
4       67  sudhakar     56       87         66
5       23   abhisek     73       99         98

In [27]:
df.set_index('Name',inplace=True)

In [28]:
df

          biology  Maths  physcis  chemistry
Name
shaiksha       99     78       67         89
vivek          56     57       98         67
anil           73     85       93         87
kesava         34     98       45         34
sudhakar       67     56       87         66
abhisek        23     73       99         98

In [29]:
print("h")

h